OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
/*
 * Copyright (c) 2013-2020 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/* Driver_SPI.c - CMSIS-Driver for Nuvoton SPI */

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#ifdef _RTE_
    #include "RTE_Components.h"
#endif
/* Project can define PRJ_RTE_DEVICE_HEADER macro to include private or global RTE_Device.h. */
#ifdef   PRJ_RTE_DEVICE_HEADER
    #include PRJ_RTE_DEVICE_HEADER
#else
    #include "../RTE_Device/RTE_Device.h"
#endif

#include "Driver_SPI.h"
#include "drv_pdma.h"
#include "NuMicro.h"
#include "spi_hal.h"

//------------------------------------------------------------------------------
#define RTE_SPI_SPI0                        RTE_SPI0
#define RTE_SPI_SPI1                        RTE_SPI1
#define RTE_SPI_SPI2                        RTE_SPI2
#define RTE_SPI_SPI3                        RTE_SPI3

// Configuration depending on RTE_SPI.h
// Check if at least one peripheral instance is configured in RTE_SPI.h
#if (!(RTE_SPI_SPI0) && !(RTE_SPI_SPI1) && !(RTE_SPI_SPI2) && !(RTE_SPI_SPI3))
    //#warning  SPI driver requires at least one SPI peripheral configured in RTE_SPI.h
#else
    #define DRIVER_CONFIG_VALID     1
#endif

#if defined (RTE_Driver_SAI)
    #if RTE_SAI2 && RTE_SPI0
        #error "SPI0 is used by multiple CMSIS Drivers! Please check RTE device configuration to fix it."
    #endif

    #if RTE_SAI3 && RTE_SPI1
        #error "SPI1 is used by multiple CMSIS Drivers! Please check RTE device configuration to fix it."
    #endif

    #if RTE_SAI4 && RTE_SPI2
        #error "SPI2 is used by multiple CMSIS Drivers! Please check RTE device configuration to fix it."
    #endif

    #if RTE_SAI5 && RTE_SPI3
        #error "SPI3 is used by multiple CMSIS Drivers! Please check RTE device configuration to fix it."
    #endif
#endif

// *****************************************************************************

#ifdef DRIVER_CONFIG_VALID     // Driver code is available only if configuration is valid

#if (RTE_SPI_SPI0 == 1)
    #define SPI_SPI_IDX0                    0
    #define SPI_SPI_PORT0                   0
    #define SPI_PORTSYM_FROM_RTE_0          SPI_SPI_PORT0
#endif

#if (RTE_SPI_SPI1 == 1)
    #define SPI_SPI_IDX1                    1
    #define SPI_SPI_PORT1                   1
    #define SPI_PORTSYM_FROM_RTE_1          SPI_SPI_PORT1
#endif

#if (RTE_SPI_SPI2 == 1)
    #define SPI_SPI_IDX2                    2
    #define SPI_SPI_PORT2                   2
    #define SPI_PORTSYM_FROM_RTE_2          SPI_SPI_PORT2
#endif

#if (RTE_SPI_SPI3 == 1)
    #define SPI_SPI_IDX3                    3
    #define SPI_SPI_PORT3                   3
    #define SPI_PORTSYM_FROM_RTE_3          SPI_SPI_PORT3
#endif

static inline uint32_t spi_idx_from_port_rt(uint32_t n)
{
    switch (n)
    {
#if (RTE_SPI_SPI0 == 1)

        case SPI_SPI_IDX0:
            return SPI_SPI_PORT0;
#endif

#if (RTE_SPI_SPI1 == 1)

        case SPI_SPI_IDX1:
            return SPI_SPI_PORT1;
#endif

#if (RTE_SPI_SPI2 == 1)

        case SPI_SPI_IDX2:
            return SPI_SPI_PORT2;
#endif

#if (RTE_SPI_SPI3 == 1)

        case SPI_SPI_IDX3:
            return SPI_SPI_PORT3;
#endif

        default:
            return 0;
    }
}

#define SPI_IDX_FROM_PORT_CAT(x)        SPI_PORTSYM_FROM_RTE_##x
#define SPI_IDX_FROM_PORT(x)            SPI_IDX_FROM_PORT_CAT(x)

#define SPI_TO_SPI_INSTANCE(n)          ( spi_idx_from_port_rt((uint32_t)(n)) )
#define SPI_TO_SPI(n)                   ( SPI_CONCAT2(SPI, SPI_IDX_FROM_PORT(n)) )

#define SPI_TO_SPI_XFER_MODE(n)         ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _XFER_MODE) )
#define SPI_TO_SPI_PDMA_RX(n)           ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _RX_PDMA) )
#define SPI_TO_SPI_PDMA_TX(n)           ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _TX_PDMA) )
#define SPI_TO_SPI_PDMA_RX_PORT(n)      ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _RX_PDMA_PORT) )
#define SPI_TO_SPI_PDMA_TX_PORT(n)      ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _TX_PDMA_PORT) )
#define SPI_TO_SPI_PDMA_RX_CH(n)        ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _RX_PDMA_CHANNEL) )
#define SPI_TO_SPI_PDMA_TX_CH(n)        ( SPI_CONCAT3(RTE_SPI, SPI_IDX_FROM_PORT(n), _TX_PDMA_CHANNEL) )

#define SPI_TO_SPI_PDMA_RX_NUM(n)       ( SPI_CONCAT3(PDMA_SPI, SPI_IDX_FROM_PORT(n), _RX) )
#define SPI_TO_SPI_PDMA_TX_NUM(n)       ( SPI_CONCAT3(PDMA_SPI, SPI_IDX_FROM_PORT(n), _TX) )

// Local driver functions declarations (for instances)
#define SPI_INFO_DEFINE(n)                                                      \
    static SPI_RESOURCES SPI_RES_NAME(n) = { SPI_TO_SPI(n),                     \
                                             { \
                                               SPI_TO_SPI_XFER_MODE(n),         \
                                               0,                               \
                                             },                                 \
                                             {0},                               \
                                             {0},                               \
                                             {-1,                               \
                                              -1,                               \
                                              SPI_TO_SPI_PDMA_RX(n),            \
                                              SPI_TO_SPI_PDMA_TX(n),            \
                                              SPI_TO_SPI_PDMA_RX_PORT(n),       \
                                              SPI_TO_SPI_PDMA_TX_PORT(n),       \
                                              SPI_TO_SPI_PDMA_RX_CH(n),         \
                                              SPI_TO_SPI_PDMA_TX_CH(n),         \
                                              SPI_TO_SPI_PDMA_RX_NUM(n),        \
                                              SPI_TO_SPI_PDMA_TX_NUM(n),        \
                                             }                                  \
                                           };

