OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
static void SPI_RxIRQHandler(uint32_t u32Inst, uint32_t u32DataBits, uint32_t u32PatternMask)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = pSPIn->phspi;
    uint32_t au32RxBuf[8] = {0};  // Local temporary buffer for batch RX from FIFO
    uint32_t u32Count = 0, u32i = 0;

    // Step 1: Batch read all available data from RX FIFO (store raw data first)
    while (!SPI_GET_RX_FIFO_EMPTY_FLAG(phspi) &&
            (u32Count < SPI_ARRAY_SIZE(au32RxBuf)) &&
            ((pSPIn->sXfer.u32RxCnt + u32Count) < pSPIn->sXfer.u32Num))
    {
        au32RxBuf[u32Count++] = SPI_READ_RX(phspi);
    }

    // Step 2: Process DataBits conversion after raw data is fetched
    for (u32i = 0; u32i < u32Count; u32i++)
    {
        uint32_t raw = au32RxBuf[u32i] & u32PatternMask;
        SPI_StoreRxData(pSPIn, raw, u32DataBits);
        pSPIn->sXfer.u32RxCnt++;
    }
}

static void SPI_TxIRQHandler(uint32_t u32Inst, uint32_t u32DataBits, uint32_t u32PatternMask)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint8_t  *pu8TxBuf  = pSPIn->sXfer.pu8TxBuf;
    uint16_t *pu16TxBuf = (uint16_t *)pSPIn->sXfer.pu8TxBuf;
    uint32_t *pu32TxBuf = (uint32_t *)pSPIn->sXfer.pu8TxBuf;
    uint32_t u32TxData = 0;

    // Half-Duplex mode handling TX
    if ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) &&
            (pSPIn->sXfer.pu8TxBuf == NULL))
    {
        return;
    }

    // Check TX FIFO not full and there's data left to send
    while ((!SPI_GET_TX_FIFO_FULL_FLAG(phspi)) &&
            (pSPIn->sXfer.u32TxCnt < pSPIn->sXfer.u32Num))
    {
        if (pu8TxBuf == NULL)
        {
            u32TxData = pSPIn->sXfer.u32DefVal;
        }
        else
        {
            // Retrieve data and mask accurately based on DataBits.
            if ((u32DataBits <= 8) && (u32DataBits != 0))
            {
                u32TxData = (uint8_t)(pu8TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
            else if ((u32DataBits <= 16) && (u32DataBits != 0))
            {
                u32TxData = (uint16_t)(pu16TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
            else // default write as 32-bit
            {
                u32TxData = (uint32_t)(pu32TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
        }

        phspi->TX = (u32TxData & u32PatternMask);
        pSPIn->sXfer.u32TxCnt++;
    }

    // Transmission completed, disable interrupt
    if ((SPI_IS_BUSY(phspi) == 0) && (pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num))
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK);
        SPI_DisableInt(phspi, SPI_FIFO_TXTH_INT_MASK); // Disable TX FIFO threshold interrupt
    }
}

// SPI interrupt handler
static void SPI_IRQHandler(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos);
    uint32_t u32PatternMask = (0xFFFFFFFF >> (32 - ((u32DataBits == 0) ? 32 : u32DataBits)));

    if (SPI_GetIntFlag(phspi, SPI_SSINACT_INT_MASK))
    {
        SPI_ClearIntFlag(phspi, SPI_SSINACT_INT_MASK);
    }

    if (SPI_GetIntFlag(phspi, SPI_FIFO_RXTO_INT_MASK))
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_RXTO_INT_MASK);
        SPI_RxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    if (!SPI_GET_TX_FIFO_FULL_FLAG(phspi))
    {
        SPI_TxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    if (!SPI_GET_RX_FIFO_EMPTY_FLAG(phspi))
    {
        SPI_RxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    // Relax the Transfer Complete condition
    if ((pSPIn->sXfer.u32RxCnt >= pSPIn->sXfer.u32Num) &&
            (pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num) &&
            SPI_GET_TX_FIFO_EMPTY_FLAG(phspi) &&
            (!SPI_IS_BUSY(phspi)))
    {
        pSPIn->sState.sDrvStatus.u8Busy = 0U;

        if (pSPIn->sState.cb_event)
        {
            pSPIn->sState.cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
        }
    }
}

// Configure SPI interrupt
static void SPI_InterruptConfig(uint32_t u32Inst, uint32_t u32IntEn)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    IRQn_Type irq_n = SPI0_IRQn; // Default SPI0 interrupt
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    // Select the corresponding interrupt number based on the SPI instance
    irq_n = ((uint32_t)phspi == (uint32_t)SPI0) ? SPI0_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI1) ? SPI1_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI2) ? SPI2_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI3) ? SPI3_IRQn :
            SPI0_IRQn;

    /* Unlock protected registers */
    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    if (u32IntEn == SPI_OP_ENABLE)
    {
        // Enable the corresponding SPI interrupt
        NVIC_EnableIRQ(irq_n);
    }
    else
    {
        // Disable the corresponding SPI interrupt
        NVIC_DisableIRQ(irq_n);
    }

    /* Lock protected registers */
    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }
}

/**
  \fn          ARM_DRIVER_VERSION SPI_GetVersion (void)
  \brief       Get SPI driver version.
  \return      \ref ARM_DRV_VERSION
*/
static ARM_DRIVER_VERSION SPIn_GetVersion(void)
{
    return DriverVersion;
}

/**
  \fn          ARM_SPI_CAPABILITIES SPI_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_SPI_CAPABILITIES
*/
static ARM_SPI_CAPABILITIES SPIn_GetCapabilities(void)
{
    return DriverCapabilities;
}

/**
  \fn          int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event)
  \brief       Initialize SPI Interface.
  \param[in]   cb_event  Pointer to \ref ARM_SPI_SignalEvent
  \return      \ref execution_status
*/
static int32_t SPIn_Initialize(uint32_t u32Inst, ARM_SPI_SignalEvent_t cb_event)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];

    if (pSPIn->sState.u8State & SPI_INITIALIZED) return ARM_DRIVER_OK;

    // Initialize SPI Run-Time Resources
    pSPIn->sState.cb_event = cb_event;
    pSPIn->sState.sDrvStatus.u8Busy = 0U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Clear transfer information
    memset(&pSPIn->sXfer, 0, sizeof(SPI_TRANSFER_INFO));

