OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
    // Terminate and free RX PDMA channel if used
    if (pSPIn->spdma.u32RxUsed == 1)
    {
        if ((pSPIn->spdma.i32RxChnId >= 0) &&
                (pSPIn->spdma.i32RxChnId < (int32_t)(PDMA_CH_MAX * PDMA_CNT)))
        {
            nu_pdma_channel_terminate(pSPIn->spdma.i32RxChnId);
            nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
        }
    }

    // Terminate and free TX PDMA channel if used
    if (pSPIn->spdma.u32TxUsed == 1)
    {
        if ((pSPIn->spdma.i32TxChnId >= 0) &&
                (pSPIn->spdma.i32TxChnId < (int32_t)(PDMA_CH_MAX * PDMA_CNT)))
        {
            nu_pdma_channel_terminate(pSPIn->spdma.i32TxChnId);
            nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
        }
    }

    // Reset PDMA channel IDs
    pSPIn->spdma.i32RxChnId = -1;
    pSPIn->spdma.i32TxChnId = -1;

    pSPIn->sState.u8State = SPI_INITIALIZED; // SPI is initialized

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Uninitialize (void)
  \brief       De-initialize SPI Interface.
  \return      \ref execution_status
*/
static int32_t SPIn_Uninitialize(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    SPI_InterruptConfig(u32Inst, SPI_OP_DISABLE); // Disable SPI interrupts

    SPI_Close(phspi);

    // Free PDMA channels
    if (pSPIn->spdma.i32RxChnId != -1)
    {
        nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
        pSPIn->spdma.i32RxChnId = -1;
    }

    if (pSPIn->spdma.i32TxChnId != -1)
    {
        nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
        pSPIn->spdma.i32TxChnId = -1;
    }

    pSPIn->sState.u8State = 0U;  // SPI is uninitialized

    memset(&pSPIn->sState.sDrvStatus, 0, sizeof(SPI_DRV_STATUS)); // Clear driver status

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_PowerControl (ARM_POWER_STATE state)
  \brief       Control SPI Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t SPIn_PowerControl(uint32_t u32Inst, ARM_POWER_STATE state)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    // Check if the power state is valid
    if ((state != ARM_POWER_OFF)  &&
            (state != ARM_POWER_FULL) &&
            (state != ARM_POWER_LOW))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (state)
    {
        case ARM_POWER_OFF:
            SPI_InterruptConfig(u32Inst, SPI_OP_DISABLE); // Disable SPI interrupts

            // Reset SPI Run-Time Resources
            pSPIn->sState.sDrvStatus.u8Busy = 0U;
            pSPIn->sState.sDrvStatus.u8DataLost = 0U;
            pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

            // Free PDMA channels
            if (pSPIn->spdma.i32RxChnId != -1)
            {
                nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
                pSPIn->spdma.i32RxChnId = -1;
            }

            if (pSPIn->spdma.i32TxChnId != -1)
            {
                nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
                pSPIn->spdma.i32TxChnId = -1;
            }

            pSPIn->sState.u8State &= ~SPI_POWERED; // SPI is not powered

            break;

        case ARM_POWER_FULL:
            if ((pSPIn->sState.u8State & SPI_INITIALIZED) == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            if ((pSPIn->sState.u8State & SPI_POWERED) != 0U)
            {
                return ARM_DRIVER_OK;
            }

            /* Unlock protected registers */
            if (u32RegLockLevel)
            {
                SYS_UnlockReg();
            }

            if ((pSPIn->spdma.u32TxUsed == 1) || (pSPIn->spdma.u32RxUsed == 1))
            {
                CLK_EnableModuleClock(PDMA0_MODULE);
                CLK_EnableModuleClock(PDMA1_MODULE);
            }

            // Reset SPI Run-Time Resources
            pSPIn->sState.sDrvStatus.u8Busy = 0U;
            pSPIn->sState.sDrvStatus.u8DataLost = 0U;
            pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

            // Allocate PDMA RX channel if PDMA RX used
            if ((pSPIn->spdma.u32RxUsed == 1) &&
                    (pSPIn->spdma.i32RxChnId == -1))
            {
                pSPIn->spdma.i32RxChnId = nu_pdma_channel_allocate(
                                              pSPIn->spdma.u32RxPerIpMode,
                                              pSPIn->spdma.u32RxPort,
                                              pSPIn->spdma.u32RxChn);
            }

            // Allocate PDMA TX channel if PDMA TX used
            if ((pSPIn->spdma.u32TxUsed == 1) && (pSPIn->spdma.i32TxChnId == -1))
            {
                pSPIn->spdma.i32TxChnId = nu_pdma_channel_allocate(
                                              pSPIn->spdma.u32TxPerIpMode,
                                              pSPIn->spdma.u32TxPort,
                                              pSPIn->spdma.u32TxChn
                                          );
            }

            /* Lock protected registers */
            if (u32RegLockLevel)
            {
                SYS_LockReg();
            }

            if ((pSPIn->spdma.i32TxChnId == -1) ||
                    (pSPIn->spdma.i32RxChnId == -1))
            {
                // Free PDMA channels
                if (pSPIn->spdma.i32RxChnId != -1)
                {
                    nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
                    pSPIn->spdma.i32RxChnId = -1;
                }

                if (pSPIn->spdma.i32TxChnId != -1)
                {
                    nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
                    pSPIn->spdma.i32TxChnId = -1;
                }

                SPI_InterruptConfig(u32Inst, SPI_OP_ENABLE); // Enable SPI interrupts
            }

            SPI_ENABLE(phspi);

            pSPIn->sState.u8State |= SPI_POWERED;  // SPI is powered
            break;

        case ARM_POWER_LOW:

            // Check if the SPI is already initialized
            if (!(pSPIn->sState.u8State & SPI_INITIALIZED)) return ARM_DRIVER_ERROR;

