OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Send (const void *data, uint32_t num)
  \brief       Start sending data to SPI transmitter.
  \param[in]   data  Pointer to buffer with data to send to SPI transmitter
  \param[in]   num   Number of data items to send
  \return      \ref execution_status
*/
static int32_t SPIn_Send(uint32_t u32Inst, const void *data, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    // Check if data and num are valid
    if ((data == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI status
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set transfer buffers and count
    pSPIn->sXfer.pu8RxBuf = NULL;
    pSPIn->sXfer.pu8TxBuf = (uint8_t *)(uint32_t)data;
    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->CTL |= SPI_CTL_HALFDPX_Msk;
        phspi->CTL |= SPI_CTL_DATDIR_Msk; // Set TX mode
    }

    // Check if PDMA channel is available for TX
    if (pSPIn->spdma.i32TxChnId != -1)
    {
        if ((pSPIn->sXfer.pu8RxBuf == NULL) &&
                (pSPIn->sState.u32Mode & ARM_SPI_MODE_SLAVE))
        {
            // Dummy TX buffer for PDMA Send, even in Receive-only mode
            SPI_PrepareDefaultRxBuffer(pSPIn, ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos), num);
        }

        SPI_PDMA_RXInit(pSPIn);
        SPI_PDMA_TXInit(pSPIn);
        /* Enable SPI master DMA function */
        SPI_TRIGGER_TX_RX_PDMA(phspi);
    }
    else
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

        /* Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt */
        SPI_EnableInt(phspi, ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) ?
                              SPI_FIFO_TXTH_INT_MASK :
                              (SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK)));
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Receive (void *data, uint32_t num)
  \brief       Start receiving data from SPI receiver.
  \param[out]  data  Pointer to buffer for data to receive from SPI receiver
  \param[in]   num   Number of data items to receive
  \return      \ref execution_status
*/
static int32_t SPIn_Receive(uint32_t u32Inst, void *data, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    // Check for valid parameters
    if ((data == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI as busy
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set data buffers and transfer count
    pSPIn->sXfer.pu8RxBuf = (uint8_t *)data;
    pSPIn->sXfer.pu8TxBuf = NULL;

    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->CTL |= SPI_CTL_HALFDPX_Msk;
        phspi->CTL &= ~SPI_CTL_DATDIR_Msk; // Set RX mode
    }

    if (pSPIn->spdma.i32RxChnId != -1)
    {
        if (pSPIn->sXfer.pu8TxBuf == NULL)
        {
            // Dummy TX buffer for PDMA Send, even in Receive-only mode
            SPI_PrepareDefaultTxBuffer(pSPIn, ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos), num);
        }

        SPI_PDMA_TXInit(pSPIn);
        SPI_PDMA_RXInit(pSPIn);
        /* Enable SPI master DMA function */
        SPI_TRIGGER_TX_RX_PDMA(phspi);
    }
    else
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

        /* Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt */
        SPI_EnableInt(phspi,
                      ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) ?
                       SPI_FIFO_RXTO_INT_MASK :
                       (SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK)));
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Transfer (const void     *data_out,
                                            void    *data_in,
                                            uint32_t num)
  \brief       Start sending/receiving data to/from SPI transmitter/receiver.
  \param[in]   data_out  Pointer to buffer with data to send to SPI transmitter
  \param[out]  data_in   Pointer to buffer for data to receive from SPI receiver
  \param[in]   num       Number of data items to transfer
  \return      \ref execution_status
*/
static int32_t SPIn_Transfer(uint32_t u32Inst, const void *data_out, void *data_in, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    // Check for valid parameters
    if ((data_out == NULL) || (data_in == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI as busy
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set data buffers and transfer count
    pSPIn->sXfer.pu8RxBuf = (uint8_t *)data_in;
    pSPIn->sXfer.pu8TxBuf = (uint8_t *)(uint32_t)data_out;
    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    // **Support Half-Duplex mode**
    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->CTL |= SPI_CTL_HALFDPX_Msk; // Enable Half-Duplex mode

        if (data_out && !data_in)
        {
            phspi->CTL |= SPI_CTL_DATDIR_Msk; // Set TX mode
        }
        else if (data_in && !data_out)
        {
            phspi->CTL &= ~SPI_CTL_DATDIR_Msk; // Set RX mode
        }
        else
        {
            return ARM_DRIVER_ERROR_PARAMETER; // In Half-Duplex mode, cannot perform TX and RX simultaneously
        }
    }

    // Initialize and trigger PDMA if available
    if (pSPIn->spdma.i32RxChnId != -1)
    {
        if (data_in && !data_out)  // **Half-Duplex RX Mode**
        {
            SPI_PDMA_RXInit(pSPIn);
            SPI_TRIGGER_RX_PDMA(phspi);
        }
        else if (data_out && !data_in)  // **Half-Duplex TX Mode**
        {
            SPI_PDMA_TXInit(pSPIn);
            SPI_TRIGGER_TX_PDMA(phspi);
        }
        else  // **Full-Duplex Mode**
        {
            SPI_PDMA_RXInit(pSPIn);
            SPI_PDMA_TXInit(pSPIn);
            SPI_TRIGGER_TX_RX_PDMA(phspi);
        }
    }
    else
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

        // Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt
        if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
        {
            if (data_out && !data_in)  // **Half-Duplex TX Mode**
            {
                SPI_EnableInt(phspi, SPI_FIFO_TXTH_INT_MASK);
            }
            else if (data_in && !data_out)  // **Half-Duplex RX Mode**
            {
                SPI_EnableInt(phspi, SPI_FIFO_RXTO_INT_MASK);
            }
        }
        else  // **Full-Duplex Mode**
        {
            SPI_EnableInt(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);
        }
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          uint32_t SPI_GetDataCount (void)
  \brief       Get transferred data count.
  \return      number of data items transferred
*/
static uint32_t SPIn_GetDataCount(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];

