OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
        case ARM_SPI_CPOL0_CPHA1:
            phspi->CTL = (phspi->CTL & ~(SPI_CTL_CLKPOL_Msk | SPI_CTL_TXNEG_Msk | SPI_CTL_RXNEG_Msk)) | SPI_MODE_1;
            break;

        case ARM_SPI_CPOL1_CPHA0:
            phspi->CTL = (phspi->CTL & ~(SPI_CTL_CLKPOL_Msk | SPI_CTL_TXNEG_Msk | SPI_CTL_RXNEG_Msk)) | SPI_MODE_2;
            break;

        case ARM_SPI_CPOL1_CPHA1:
            phspi->CTL = (phspi->CTL & ~(SPI_CTL_CLKPOL_Msk | SPI_CTL_TXNEG_Msk | SPI_CTL_RXNEG_Msk)) | SPI_MODE_3;
            break;

        default:
            return ARM_SPI_ERROR_FRAME_FORMAT;
    }

    // Data Bits
    u32DataBits = ((control & ARM_SPI_DATA_BITS_Msk) >> ARM_SPI_DATA_BITS_Pos);

    if ((u32DataBits > 0) && (u32DataBits < 4))
    {
        return ARM_SPI_ERROR_DATA_BITS;
    }

    phspi->CTL = (phspi->CTL & ~SPI_CTL_DWIDTH_Msk) |
                 (((u32DataBits >= 32) ? 0 : u32DataBits) << SPI_CTL_DWIDTH_Pos);

    // MSB / LSB First
    if ((control & ARM_SPI_BIT_ORDER_Msk) == ARM_SPI_LSB_MSB)
    {
        SPI_SET_LSB_FIRST(phspi);
    }
    else
    {
        SPI_SET_MSB_FIRST(phspi);
    }

    SPI_SetFIFO(phspi, (u32DataBits <= 16) ? 7 : 3, (u32DataBits <= 16) ? 7 : 3);

    // Clear RX & TX FIFOs
    SPI_ClearRxFIFO(phspi);
    SPI_ClearTxFIFO(phspi);

    // Enable SPI if needed
    if (pSPIn->sState.u8State & SPI_POWERED)
    {
        SPI_ENABLE(phspi);
    }

    pSPIn->sState.u8State |= SPI_CONFIGURED;

    return ARM_DRIVER_OK;
}

/**
  \fn          ARM_SPI_STATUS SPI_GetStatus (void)
  \brief       Get SPI status.
  \return      SPI status \ref ARM_SPI_STATUS
*/
static ARM_SPI_STATUS SPIn_GetStatus(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    ARM_SPI_STATUS status = {0};

    status.busy = pSPIn->sState.sDrvStatus.u8Busy;
    status.data_lost = pSPIn->sState.sDrvStatus.u8DataLost;
    status.mode_fault = pSPIn->sState.sDrvStatus.u8ModeFault;

    return (status);
}

static int32_t SPI_PrepareDefaultRxBuffer(SPI_RESOURCES *pSPIn, uint32_t u32DataBits, uint32_t u32Num)
{
    uint32_t u32ItemSize = (u32DataBits == 0) ? 4 : ((u32DataBits + 7) / 8);
    uint32_t u32TotalBytes = u32Num * u32ItemSize;

    if ((u32Num == 0) || (pSPIn->sXfer.pu8RxBuf != NULL))
        return ARM_DRIVER_OK;

    void *pBuf = malloc(u32TotalBytes);

    if (!pBuf)
        return ARM_DRIVER_ERROR;

    // Store the result and pointer of malloc for TX use
    pSPIn->sXfer.pu8RxBuf = (uint8_t *)pBuf;

    pSPIn->sXfer.u32RxPrepared = SPI_OP_ENABLE;

    return ARM_DRIVER_OK;
}

static int32_t SPI_PrepareDefaultTxBuffer(SPI_RESOURCES *pSPIn, uint32_t u32DataBits, uint32_t u32Num)
{
    uint32_t u32DefVal = pSPIn->sXfer.u32DefVal;
    uint32_t u32ItemSize = (u32DataBits == 0) ? 4 : ((u32DataBits + 7) / 8);
    uint32_t u32TotalBytes = u32Num * u32ItemSize;

    if ((u32Num == 0) || (pSPIn->sXfer.pu8TxBuf != NULL))
        return ARM_DRIVER_OK;

    void *pBuf = malloc(u32TotalBytes);

    if (!pBuf)
        return ARM_DRIVER_ERROR;

    if ((u32DataBits <= 8) && (u32DataBits > 0))
    {
        uint8_t *buf = (uint8_t *)pBuf;

        for (uint32_t i = 0; i < u32Num; i++)
            buf[i] = (uint8_t)(u32DefVal & 0xFF);
    }
    else if ((u32DataBits <= 16) && (u32DataBits > 0))
    {
        uint16_t *buf = (uint16_t *)pBuf;

        for (uint32_t i = 0; i < u32Num; i++)
            buf[i] = (uint16_t)(u32DefVal & 0xFFFF);
    }
    else
    {
        uint32_t *buf = (uint32_t *)pBuf;

        for (uint32_t i = 0; i < u32Num; i++)
            buf[i] = u32DefVal;
    }

    // Store the result and pointer of malloc for TX use
    pSPIn->sXfer.pu8TxBuf = (uint8_t *)pBuf;

    pSPIn->sXfer.u32TxPrepared = SPI_OP_ENABLE;

    return ARM_DRIVER_OK;
}

static void SPI_ReleaseDefaultTxBuffer(SPI_RESOURCES *pSPIn)
{
    if ((pSPIn->sXfer.pu8TxBuf == NULL) ||
            ((!pSPIn->sXfer.u32TxPrepared) && (!pSPIn->sXfer.u32RxPrepared)))
        return;

    if (pSPIn->sXfer.u32TxPrepared == SPI_OP_ENABLE)
    {
        pSPIn->sXfer.u32TxPrepared = SPI_OP_DISABLE;
        free(pSPIn->sXfer.pu8TxBuf);
        pSPIn->sXfer.pu8TxBuf = NULL;
    }

    if (pSPIn->sXfer.u32RxPrepared)
    {
        pSPIn->sXfer.u32RxPrepared = SPI_OP_DISABLE;
        free(pSPIn->sXfer.pu8RxBuf);
        pSPIn->sXfer.pu8RxBuf = NULL;
    }
}

static void SPI_PDMA_TXInit(SPI_RESOURCES *pSPIn)
{
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->CTL & (SPI_CTL_DWIDTH_Msk)) >> SPI_CTL_DWIDTH_Pos);

    //Use PDMA transfer mode
    struct nu_pdma_chn_cb pdma_chn_cb;

    if (pSPIn->sXfer.pu8TxBuf == NULL)
    {
        return;
    }

    pdma_chn_cb.m_eCBType = eCBType_Event;
    pdma_chn_cb.m_pfnCBHandler = SPI_PDMA_TX_CB;
    pdma_chn_cb.m_pvUserData = (void *)pSPIn;

    //Use PDMA transfer mode
    nu_pdma_filtering_set(pSPIn->spdma.i32TxChnId, NU_PDMA_EVENT_TRANSFER_DONE);
    nu_pdma_callback_register(pSPIn->spdma.i32TxChnId, &pdma_chn_cb);
    nu_pdma_transfer(
        pSPIn->spdma.i32TxChnId,
        ((u32DataBits <= 8) && (u32DataBits > 0)) ? 8
        : ((u32DataBits > 8) && (u32DataBits <= 16)) ? 16
        : 32,
        (uint32_t)pSPIn->sXfer.pu8TxBuf,
        (uint32_t)&phspi->TX,
        pSPIn->sXfer.u32Num,
        0);
}

static void SPI_PDMA_RXInit(SPI_RESOURCES *pSPIn)
{
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32DataBits = ((phspi->CTL & (SPI_CTL_DWIDTH_Msk)) >> SPI_CTL_DWIDTH_Pos);
    //Use PDMA transfer mode
    struct nu_pdma_chn_cb pdma_chn_cb;

    if (pSPIn->sXfer.pu8RxBuf == NULL)
    {
        return;
    }

    pdma_chn_cb.m_eCBType = eCBType_Event;
    pdma_chn_cb.m_pfnCBHandler = SPI_PDMA_RX_CB;
    pdma_chn_cb.m_pvUserData = (void *)pSPIn;

    //Use PDMA transfer mode
    nu_pdma_filtering_set(pSPIn->spdma.i32RxChnId, NU_PDMA_EVENT_TRANSFER_DONE);
    nu_pdma_callback_register(pSPIn->spdma.i32RxChnId, &pdma_chn_cb);
    nu_pdma_transfer(
        pSPIn->spdma.i32RxChnId,
        ((u32DataBits <= 8) && (u32DataBits > 0)) ? 8
        : ((u32DataBits > 8) && (u32DataBits <= 16)) ? 16
        : 32,
        (uint32_t)&phspi->RX,
        (uint32_t)pSPIn->sXfer.pu8RxBuf,
        pSPIn->sXfer.u32Num,
        0);
}

// Local driver functions definitions (for instances)
// Information definitions (for instances)
#if (RTE_SPI_SPI0 == 1)
FUNCS_DEFINE(SPI_SPI_IDX0)
SPI_DRIVER(SPI_SPI_IDX0)

NVT_ITCM void SPI0_IRQHandler(void)
{
    SPI_IRQHandler(SPI_SPI_IDX0);
}
#endif

#if (RTE_SPI_SPI1 == 1)
FUNCS_DEFINE(SPI_SPI_IDX1)
SPI_DRIVER(SPI_SPI_IDX1)

NVT_ITCM void SPI1_IRQHandler(void)
{
    SPI_IRQHandler(SPI_SPI_IDX1);
}
#endif

#if (RTE_SPI_SPI2 == 1)
FUNCS_DEFINE(SPI_SPI_IDX2)
SPI_DRIVER(SPI_SPI_IDX2)

NVT_ITCM void SPI2_IRQHandler(void)
{
    SPI_IRQHandler(SPI_SPI_IDX2);
}
#endif

#if (RTE_SPI_SPI3 == 1)
FUNCS_DEFINE(SPI_SPI_IDX3)
SPI_DRIVER(SPI_SPI_IDX3)

NVT_ITCM void SPI3_IRQHandler(void)
{
    SPI_IRQHandler(SPI_SPI_IDX3);
}
#endif

#endif //DRIVER_CONFIG_VALID
